Repository: abdulasaad/myapp
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Mark the place as inactive to hide it from new routes while preserving history
ar: قم بتمييز المكان كغير نشط لإخفائه من المسارات الجديدة مع الحفاظ على التاريخ

source: Go to
ar: اذهب إلى

source: Are you sure you want to permanently remove
ar: هل أنت متأكد من أنك تريد الإزالة الدائمة

source: This place is not used in any routes or visits and can be safely deleted
ar: هذا المكان غير مستخدم في أي مسارات أو زيارات ويمكن حذفه بأمان

source: This action cannot be undone. The place will be permanently deleted from the system
ar: لا يمكن التراجع عن هذا الإجراء. سيتم حذف المكان نهائياً من النظام

source: Are you sure you want to deactivate
ar: هل أنت متأكد من أنك تريد إلغاء التفعيل

source: The place will be hidden from new routes but all historical data will be preserved. You can reactivate it later
ar: سيتم إخفاء المكان من المسارات الجديدة ولكن جميع البيانات التاريخية ستبقى محفوظة. يمكنك إعادة تفعيله لاحقاً

source: Edit Location
ar: تعديل الموقع

source: No groups found for this manager
ar: لا توجد مجموعات لهذا المدير

source: No available places to add to this route
ar: لا توجد أماكن متاحة لإضافتها إلى هذا المسار

source: Error loading available places
ar: خطأ في تحميل الأماكن المتاحة

source: Place added to route successfully
ar: تمت إضافة المكان إلى المسار بنجاح

source: Error adding place to route
ar: خطأ في إضافة المكان إلى المسار

source: Created by
ar: تم الإنشاء بواسطة

# evidenceRequiredFormat
source: {current}/{required} evidence required
ar: {current}/{required} دليل مطلوب

# evidenceFilesFormat
source: {count} evidence file(s)
ar: {count} ملف أدلة

# evidenceRequiredCount
source: {count} evidence required
ar: {count} دليل مطلوب

# routesWillBeAssigned
source: Your manager will assign routes for you to visit.
ar: سيقوم مديرك بتعيين مسارات لك لزيارتها.

# checkoutComingSoon
source: Check-out functionality - Coming soon!
ar: وظيفة المغادرة - قريبًا!

source: Evidence upload - Coming soon!
ar: رفع الأدلة - قريبًا!

source: Suggest New Place
ar: اقتراح مكان جديد

# placeNameRequired
source: Place Name *
ar: اسم المكان *

source: Enter place name
ar: أدخل اسم المكان

source: Description
ar: الوصف

# briefDescription
source: Brief description of the place
ar: وصف موجز للمكان

source: Address
ar: العنوان

source: Street address or landmark
ar: عنوان الشارع أو معلم

# locationRequired
source: Location *
ar: الموقع *

source: Selected Location:
ar: الموقع المحدد:

source: Radius
ar: نصف القطر

source: Select Location on Map
ar: اختر الموقع على الخريطة

source: Change Location
ar: تغيير الموقع

source: Submit Suggestion
ar: إرسال الاقتراح

source: Please fill required fields
ar: يرجى ملء الحقول المطلوبة

source: Authentication required
ar: المصادقة مطلوبة

# placeSuggestionSubmitted
source: Place suggestion submitted! Waiting for manager approval.
ar: تم إرسال اقتراح المكان! في انتظار موافقة المدير.

source: Error submitting suggestion
ar: خطأ في إرسال الاقتراح

source: Error loading form
ar: خطأ في تحميل النموذج

source: No Form Fields
ar: لا توجد حقول نموذج

# noCustomFieldsConfigured
source: This template has no custom fields configured.
ar: هذا القالب لا يحتوي على حقول مخصصة مُكونة.

source: Required
ar: مطلوب

source: Enter email address
ar: أدخل عنوان البريد الإلكتروني

source: Enter phone number
ar: أدخل رقم الهاتف

source: Select an option
ar: اختر خيارًا

source: Select date
ar: اختر التاريخ

source: Select time
ar: اختر الوقت

source: Signature
ar: التوقيع

# pleaseSignToConfirm
source: Please sign below to confirm completion
ar: يرجى التوقيع أدناه لتأكيد الإنجاز

source: Clear Signature
ar: مسح التوقيع

source: Submitting...
ar: جارٍ الإرسال...

source: Submit Form
ar: إرسال النموذج

source: is required
ar: مطلوب

# pleaseEnterValidEmail
source: Please enter a valid email address
ar: يرجى إدخال عنوان بريد إلكتروني صالح

# pleaseEnterValidPhone
source: Please enter a valid phone number
ar: يرجى إدخال رقم هاتف صالح

# pleaseEnterValidNumber
source: Please enter a valid number
ar: يرجى إدخال رقم صالح

source: must be at least
ar: يجب أن يكون على الأقل

source: characters
ar: أحرف

source: must be no more than
ar: يجب ألا يزيد عن

# signatureRequired
source: Signature is required
ar: التوقيع مطلوب

source: Form submitted successfully!
ar: تم إرسال النموذج بنجاح!

source: Failed to submit form
ar: فشل في إرسال النموذج

source: Form Data
ar: بيانات النموذج

# uploadSupportingEvidence
source: Upload supporting evidence for this task (optional)
ar: رفع أدلة داعمة لهذه المهمة (اختياري)

source: File uploaded
ar: تم رفع الملف

source: Evidence uploaded successfully!
ar: تم رفع الدليل بنجاح!

source: Failed to upload evidence
ar: فشل في رفع الدليل

source: My Submissions
ar: إرسالاتي

source: Type
ar: النوع

source: Forms
ar: النماذج

source: PENDING
ar: معلق

source: Loading submissions...
ar: جارٍ تحميل الإرسالات...

source: Try Again
ar: حاول مرة أخرى

source: more fields
ar: حقول أخرى

source: Form
ar: نموذج

source: No Submissions Yet
ar: لا توجد إرسالات بعد

# submissionsWillAppearHere
source: Your form submissions and evidence uploads will appear here.
ar: ستظهر إرسالات النماذج ورفع الأدلة هنا.

source: User Management
ar: إدارة المستخدمين

source: Evidence Review
ar: مراجعة الأدلة

source: Admin Dashboard
ar: لوحة تحكم المدير

# searchByName
source: Search by name, email, or username...
ar: البحث بالاسم أو البريد الإلكتروني أو اسم المستخدم...

source: All Users
ar: جميع المستخدمين

source: Managers Only
ar: المديرون فقط

source: Agents Only
ar: المندوبون فقط

source: No Users Found
ar: لم يتم العثور على مستخدمين

# tryAdjustingFilters
source: Try adjusting your search or filters
ar: جرب تعديل البحث أو المرشحات

# createFirstUser
source: Get started by creating your first user
ar: ابدأ بإنشاء أول مستخدم

source: Create User
ar: إنشاء مستخدم

source: View Details
ar: عرض التفاصيل

source: Activate
ar: تفعيل

source: Deactivate
ar: إلغاء التفعيل

source: Search groups...
ar: البحث في المجموعات...

source: No groups found
ar: لم يتم العثور على مجموعات

# noGroupsMatch
source: No groups match your search
ar: لا توجد مجموعات تطابق البحث

# createFirstGroup
source: Create your first group to get started
ar: أنشئ مجموعتك الأولى للبدء

source: Create Group
ar: إنشاء مجموعة

source: Delete Group
ar: حذف المجموعة

# confirmDeleteGroup
source: Are you sure you want to delete "{name}"? This action cannot be undone.
ar: هل أنت متأكد من رغبتك في حذف "{name}"؟ هذا الإجراء لا يمكن التراجع عنه.

# groupDeleted
source: Group "{name}" deleted successfully
ar: تم حذف المجموعة "{name}" بنجاح

source: Failed to delete group
ar: فشل في حذف المجموعة

source: Good Morning
ar: صباح الخير

source: Good Afternoon
ar: مساء الخير

source: Good Evening
ar: مساء الخير

source: System Administrator
ar: مدير النظام

# monitorPlatform
source: Monitor and manage the platform
ar: مراقبة وإدارة المنصة

source: System Overview
ar: نظرة عامة على النظام

source: Total Managers
ar: إجمالي المديرين

source: Total Agents
ar: إجمالي المندوبين

source: Active Users
ar: المستخدمون النشطون

source: Total Campaigns
ar: إجمالي الحملات

source: Total Tasks
ar: إجمالي المهام

source: New This Month
ar: جديد هذا الشهر

source: Edit
ar: تعديل

source: User
ar: مستخدم

# areYouSure
source: Are you sure you want to
ar: هل أنت متأكد من رغبتك في

# cannotBeUndone
source: This action cannot be undone
ar: هذا الإجراء لا يمكن التراجع عنه

source: Error loading data
ar: خطأ في تحميل البيانات

source: No evidence found
ar: لم يتم العثور على أدلة

# noEvidenceFromMembers
source: No evidence from members in your groups
ar: لا توجد أدلة من الأعضاء في مجموعاتك

# noEvidenceUploaded
source: No evidence uploaded yet
ar: لم يتم رفع أدلة بعد

# showingEvidenceFromMembers
source: Showing evidence from all members in your groups
ar: عرض الأدلة من جميع الأعضاء في مجموعاتك

source: Failed to refresh groups
ar: فشل في تحديث المجموعات

source: Error loading groups
ar: خطأ في تحميل المجموعات

source: Created {date}
ar: تم الإنشاء {date}

source: No description provided
ar: لم يتم تقديم وصف

source: Tap to view members
ar: اضغط لعرض الأعضاء

source: today
ar: اليوم

source: yesterday
ar: أمس

# daysAgoCount
source: {count} days ago
ar: منذ {count} أيام

source: Team Members
ar: أعضاء الفريق

source: Search team members...
ar: البحث في أعضاء الفريق...

source: All Members
ar: جميع الأعضاء

source: Online (Active/Away)
ar: متصل (نشط/غائب)

source: Offline
ar: غير متصل

source: Unable to load team members
ar: غير قادر على تحميل أعضاء الفريق

source: No members found
ar: لم يتم العثور على أعضاء

source: No online members
ar: لا يوجد أعضاء متصلين

source: No offline members
ar: لا يوجد أعضاء غير متصلين

source: No team members found
ar: لم يتم العثور على أعضاء فريق

# searchResults
source: Search: "{query}"
ar: البحث: "{query}"

source: Clear All
ar: مسح الكل

source: online
ar: متصل

source: Edit Name
ar: تعديل الاسم

source: Reset Password
ar: إعادة تعيين كلمة المرور

source: Edit Agent Name
ar: تعديل اسم الوكيل

source: Away
ar: غائب

source: My Earnings
ar: أرباحي

# errorFetchingEarnings
source: Error fetching earnings: {error}
ar: خطأ في جلب الأرباح: {error}

source: No earnings data found.
ar: لم يتم العثور على بيانات أرباح.

source: Total Earned
ar: إجمالي الأرباح

source: Total for Campaign:
ar: الإجمالي للحملة:

source: Already Paid:
ar: المدفوع بالفعل:

source: Balance for Campaign:
ar: رصيد الحملة:

source: Points Paid
ar: النقاط المدفوعة

source: Not Started
ar: لم تبدأ

source: In Area - Ready to Start
ar: في المنطقة - جاهز للبدء

source: Outside Area
ar: خارج المنطقة

source: Location Check Failed
ar: فشل فحص الموقع

source: Task Active
ar: المهمة نشطة

# taskStartedStayInArea
source: Task started! Stay in the area for {minutes} minutes.
ar: بدأت المهمة! ابق في المنطقة لمدة {minutes} دقيقة.

# youLeftDesignatedArea
source: You left the designated area. Task paused.
ar: لقد غادرت المنطقة المحددة. تم إيقاف المهمة مؤقتاً.

source: Welcome back! Task resumed.
ar: مرحباً بعودتك! تم استئناف المهمة.

source: Paused - Outside Area
ar: متوقف مؤقتاً - خارج المنطقة

source: Early Completion
ar: إكمال مبكر

# earlyCompletionConfirm
source: Are you sure you want to complete this task early?
ar: هل أنت متأكد من أنك تريد إنهاء هذه المهمة مبكراً؟

source: Geofence Stay Task
ar: مهمة البقاء في الجيوفنس

# stayInDesignatedArea
source: Stay in the designated area for the required duration.
ar: ابق في المنطقة المحددة للمدة المطلوبة.

# requiredStay
source: Required Stay: {minutes} minutes
ar: البقاء المطلوب: {minutes} دقيقة

source: Location Status
ar: حالة الموقع

source: Inside designated area
ar: داخل المنطقة المحددة

source: Outside designated area
ar: خارج المنطقة المحددة

source: Time Progress
ar: تقدم الوقت

# started
source: Started: {time}
ar: بدأ: {time}

# expectedCompletion
source: Expected completion: {time}
ar: الإنهاء المتوقع: {time}

source: Progress
ar: التقدم

source: Complete Early
ar: إكمال مبكر

# noPlacesFound
source: No places found in this route
ar: لم يتم العثور على أماكن في هذا المسار

source: Places to Visit
ar: الأماكن للزيارة

source: Time Spent
ar: الوقت المستغرق

source: Route Progress
ar: تقدم المسار

source: Cooldown active
ar: فترة الانتظار نشطة

# nextVisitAvailable
source: Next visit available in {hours} hours
ar: الزيارة التالية متاحة بعد {hours} ساعات

# currentlyActiveSeeTop
source: Currently Active - See top card for actions
ar: نشط حالياً - راجع البطاقة العلوية للإجراءات

# allVisitsCompleted
source: All {count} visits completed
ar: اكتملت جميع الزيارات {count}

source: Complete previous places first
ar: أكمل الأماكن السابقة أولاً

source: Waiting...
ar: انتظار...

# visitCount
source: Visit {current}/{total}
ar: الزيارة {current}/{total}

source: Not visited
ar: لم تتم الزيارة

source: Not authenticated
ar: غير مصدق عليه

source: Already checked in
ar: تم تسجيل الدخول بالفعل

# allVisitsCompletedStatus
source: All visits completed
ar: اكتملت جميع الزيارات

source: Error checking availability
ar: خطأ في فحص التوفر

# notes
source: Notes: {notes}
ar: ملاحظات: {notes}

# zone
source: Zone {number}
ar: المنطقة {number}

source: No Location Set
ar: لم يتم تحديد موقع

# taskHasLocationNameButNoGeofence
source: This task has a location name but no geofence area defined. You can submit evidence from any location.
ar: لهذه المهمة اسم موقع ولكن لم يتم تحديد منطقة سياج جغرافي. يمكنك إرسال الأدلة من أي موقع.

# managerNotSetLocation
source: The manager has not set a specific location or geofence for this task. You can submit evidence from any location.
ar: لم يحدد المدير موقعاً أو سياجاً جغرافياً محدداً لهذه المهمة. يمكنك إرسال الأدلة من أي موقع.

source: Geofence Areas
ar: المناطق الجغرافية

source: Unnamed Campaign
ar: حملة بدون اسم

source: Unnamed Task
ar: مهمة بدون اسم

source: Work Areas
ar: مناطق العمل

source: No Zones Available
ar: لا توجد مناطق متاحة

# notAssignedToZones
source: You are not assigned to any campaigns or tasks with geofenced zones.
ar: لم يتم تعيينك لأي حملات أو مهام مع مناطق سياج جغرافي.

source: Task Zone
ar: منطقة المهمة

source: Campaign Zone
ar: منطقة الحملة

source: Background Services
ar: خدمات الخلفية

# locationTrackingActive
source: Location tracking and status active
ar: تتبع الموقع والحالة نشط

source: Services are stopped
ar: الخدمات متوقفة

source: Same as yesterday
ar: مثل الأمس

# chooseWhatToCreate
source: Choose what you'd like to create
ar: اختر ما تريد إنشاؤه

source: Agent
ar: مندوب

# offlineFeatureMessage
source: You're offline - Some features may not be available
ar: هذه الميزة متاحة في وضع عدم الاتصال

source: Checking...
ar: جاري التحقق

source: Requesting permission...
ar: طلب الإذن

source: Starting...
ar: البدء

# locationEnabledSuccess
source: Location service enabled successfully!
ar: تم تمكين الموقع بنجاح

# locationPermissionDeniedMessage
source: Location permission denied. Please enable it in device settings.
ar: تم رفض إذن الموقع

# failedToEnableLocation
source: Failed to enable location service
ar: فشل في تمكين الموقع

# routesAssignedSuffix
source: route
ar: الطرق المخصصة

source: Optional
ar: اختياري

source: Place Name
ar: اسم المكان

# describePlaceHint
source: Describe this place...
ar: صف هذا المكان

# enterAddress
source: Enter the address
ar: أدخل العنوان

source: No location selected
ar: لم يتم تحديد موقع

source: Geofence Radius
ar: نطاق السياج الجغرافي

source: meters
ar: متر

# fillRequiredFields
source: Please fill required fields (Name)
ar: يرجى ملء الحقول المطلوبة

# failedToSubmitSuggestion
source: Failed to submit place suggestion
ar: فشل في تقديم الاقتراح

source: Group Management
ar: إدارة المجموعات

# manageGroupsDesc
source: Manage client groups and team members
ar: إدارة المجموعات والفرق

# settingsDesc
source: App preferences and configuration
ar: تكوين تفضيلات التطبيق

source: Notifications enabled
ar: الإشعارات مفعلة

source: Setting up notifications...
ar: إعداد الإشعارات

# helpSupportDesc
source: Get help and contact support
ar: الحصول على المساعدة والدعم

source: Help & Support coming soon
ar: المساعدة والدعم قريباً

# aboutDesc
source: App version and information
ar: معلومات حول التطبيق

# aboutComingSoon
source: About information coming soon
ar: معلومات التطبيق قريباً

# signOutDesc
source: Sign out of your account
ar: تسجيل الخروج من حسابك

# signOutConfirmation
source: Are you sure you want to sign out of your account?
ar: هل أنت متأكد من تسجيل الخروج؟

# failedToSignOut
source: Failed to sign out properly
ar: فشل في تسجيل الخروج

source: An error occurred
ar: حدث خطأ

source: Awaiting Manager Approval
ar: في انتظار موافقة المدير

# evidenceRequiredMessage
source: This task requires {requiredEvidence} evidence file(s) but only {uploadedEvidence} uploaded.\n\nPlease upload the required evidence before marking the task as complete.
ar: تتطلب هذه المهمة {requiredEvidence} ملف(ات) أدلة ولكن تم رفع {uploadedEvidence} فقط.\n\nيرجى رفع الأدلة المطلوبة قبل وضع علامة على المهمة كمكتملة.

# confirmCompletionMessage
source: You have uploaded {uploaded}/{required} required evidence files. Are you sure you want to mark this task as complete?
ar: تأكيد الإنجاز

# taskAssignmentPending
source: This task assignment is pending approval from your manager. You cannot start work until it is approved.
ar: تخصيص المهمة معلق

# checkingLocationGeofence
source: Checking location for geofence validation...
ar: فحص السياج الجغرافي للموقع

# locationVerifiedUploading
source: Location verified! Uploading evidence...
ar: تم التحقق من الموقع، جاري الرفع

# uploadMoreEvidence
source: Upload {count} more evidence file(s) to complete this task
ar: رفع مزيد من الأدلة

# taskMarkedCompleted
source: Task marked as completed!
ar: تم تحديد المهمة كمنجزة

# failedToUpdateTask
source: Failed to update task: {error}
ar: فشل في تحديث المهمة

source: No Tasks Available
ar: لا توجد مهام متاحة

# noTasksAssignedMessage
source: There are no tasks assigned to you in this campaign yet. Check back later or contact your manager.
ar: لم يتم تخصيص مهام لك بعد

source: Loading tasks...
ar: جاري تحميل المهام

source: Unable to load tasks
ar: غير قادر على تحميل المهام

# pleaseCheckConnection
source: Please check your connection and try again
ar: يرجى التحقق من الاتصال

source: Account Not Assigned to Group
ar: الحساب غير مخصص لمجموعة

# accountNotAssignedMessage
source: This account has not been set to a group. Contact the system administrator.
ar: حسابك غير مخصص لأي مجموعة

# tasksWillAppear
source: Tasks will appear once you are assigned to a group
ar: ستظهر المهام هنا

# noTasksFound
source: No tasks found. Standalone tasks will appear here when created.
ar: لم يتم العثور على مهام

source: Request Assignment
ar: طلب تخصيص

source: View Location
ar: عرض الموقع

source: Submit Evidence
ar: تقديم دليل

source: Request Task Assignment
ar: طلب تخصيص مهمة

# requestAssignmentMessage
source: Do you want to request assignment to "{title}"? This will notify the manager.
ar: طلب تخصيص لهذه المهمة

source: Request
ar: طلب

# taskAssignmentRequested
source: Task assignment requested successfully!
ar: تم طلب تخصيص المهمة

# failedToRequestAssignment
source: Failed to request assignment: {error}
ar: فشل في طلب التخصيص

# assignmentRequestPending
source: Your assignment request for this task is currently pending approval from a manager. You cannot start work until it is approved. Please check back later or contact your manager for more information.
ar: طلب التخصيص معلق

# assignmentPendingApproval
source: Assignment request pending approval
ar: التخصيص في انتظار الموافقة

# cannotStartUntilApproved
source: You cannot start work on this task until your assignment request is approved by a manager.
ar: لا يمكن البدء حتى الموافقة

source: Create Campaign
ar: إنشاء حملة

source: New Campaign
ar: حملة جديدة

source: Update campaign details
ar: تحديث تفاصيل الحملة

# createNewCampaignForTeam
source: Create a new campaign for your team
ar: إنشاء حملة جديدة لفريقك

source: Campaign Name
ar: اسم الحملة

# campaignNameRequired
source: Campaign name is required
ar: اسم الحملة مطلوب

source: Assign to Manager
ar: تخصيص لمدير

# selectManagerToOversee
source: Select a manager to oversee this campaign
ar: اختر مديراً للإشراف على هذه الحملة

source: No specific manager
ar: لا يوجد مدير محدد

# campaignAssignmentInfo
source: This campaign will be assigned to the selected manager. Only they and their agents will be able to see and work on this campaign.
ar: سيتم تخصيص هذه الحملة للمدير المختار. فقط هو والوكلاء التابعون له سيتمكنون من رؤية والعمل على هذه الحملة.

source: Start Date
ar: تاريخ البداية

source: End Date
ar: تاريخ النهاية

source: Update Campaign
ar: تحديث الحملة

# pleaseSelectBothStartEndDates
source: Please select both start and end dates.
ar: يرجى اختيار تاريخي البداية والنهاية.

# endDateCannotBeforeStartDate
source: End date cannot be before the start date.
ar: تاريخ النهاية لا يمكن أن يكون قبل تاريخ البداية.

source: Campaign updated successfully!
ar: تم تحديث الحملة بنجاح!

source: Campaign created successfully!
ar: تم إنشاء الحملة بنجاح!

# failedToCreateCampaign
source: Failed to create campaign. Please try again.
ar: فشل في إنشاء الحملة. يرجى المحاولة مرة أخرى.

source: New Evidence Task
ar: مهمة أدلة جديدة

source: Edit Evidence Task
ar: تعديل مهمة الأدلة

source: Core Information
ar: المعلومات الأساسية

source: Task Name
ar: اسم المهمة

source: Location Name
ar: اسم الموقع

source: Start Date/Time
ar: تاريخ ووقت البداية

source: End Date/Time
ar: تاريخ ووقت النهاية

source: Rules & Completion
ar: القواعد والإكمال

source: Required Evidence Count
ar: عدد الأدلة المطلوبة

source: Invalid number
ar: رقم غير صحيح

source: Enable Task Points
ar: تفعيل نقاط المهمة

source: Points Awarded
ar: النقاط الممنوحة

# pointsAwardedHint
source: e.g., 10, 50, 100
ar: مثال: 10، 50، 100

# mustBePositiveNumber
source: Must be a positive number
ar: يجب أن يكون رقماً موجباً

source: Enforce Geofence for Upload
ar: فرض السياج الجغرافي للرفع

# agentMustBeInsideZone
source: Agent must be inside the zone to upload
ar: يجب على الوكيل أن يكون داخل المنطقة للرفع

# uploadsAllowedAnywhere
source: Uploads allowed from anywhere
ar: الرفع مسموح من أي مكان

source: Manager Assignment
ar: تخصيص المدير

# taskAssignmentInfo
source: This task will be assigned to the selected manager. Only they and their agents will be able to see and work on this task.
ar: سيتم تخصيص هذه المهمة للمدير المختار. فقط هو والوكلاء التابعون له سيتمكنون من رؤية والعمل على هذه المهمة.

source: Geofencing
ar: السياج الجغرافي

source: Define Geofence Zone
ar: تحديد منطقة السياج الجغرافي

# mustSaveTaskBeforeGeofence
source: Must save task before adding geofence
ar: يجب حفظ المهمة قبل إضافة السياج الجغرافي

source: Save Changes
ar: حفظ التغييرات

source: Save & Continue
ar: حفظ ومتابعة

source: Task created successfully.
ar: تم إنشاء المهمة بنجاح.

source: Task details saved.
ar: تم حفظ تفاصيل المهمة.

source: Failed to save task
ar: فشل في حفظ المهمة

# createFromTemplate
source: Create from {templateName}
ar: إنشاء من {templateName}

source: Error loading template details
ar: خطأ في تحميل تفاصيل القالب

source: Task Details
ar: تفاصيل المهمة

# taskTitleRequired
source: Task Title *
ar: عنوان المهمة *

# enterDescriptiveTitle
source: Enter a descriptive title for this task
ar: أدخل عنواناً وصفياً لهذه المهمة

source: Task title is required
ar: عنوان المهمة مطلوب

# addMoreDetailsOptional
source: Optional: Add more details about this task
ar: اختياري: أضف المزيد من التفاصيل حول هذه المهمة

# locationNameOptional
source: Optional: Name of the location (e.g., Main Hospital)
ar: اختياري: اسم الموقع (مثال: المستشفى الرئيسي)

source: Configuration
ar: التكوين

source: Points required
ar: النقاط مطلوبة

source: Must be positive
ar: يجب أن يكون موجباً

source: Evidence Files
ar: ملفات الأدلة

source: Evidence count required
ar: عدد الأدلة مطلوب

# mustBeAtLeastOne
source: Must be at least 1
ar: يجب أن يكون على الأقل 1

source: Require Location Verification
ar: طلب التحقق من الموقع

# agentMustBeAtCorrectLocation
source: Agent must be at the correct location to submit evidence
ar: يجب على الوكيل أن يكون في الموقع الصحيح لتقديم الأدلة

# geofenceConfigured
source: Geofence configured ({pointCount} points)
ar: تم تكوين السياج الجغرافي ({pointCount} نقطة)

source: Geofence not set
ar: السياج الجغرافي غير محدد

source: Set Geofence
ar: تحديد السياج الجغرافي

# defineAreaForAgents
source: Define the area where agents must be located to complete this task.
ar: حدد المنطقة التي يجب على الوكلاء التواجد فيها لإكمال هذه المهمة.

source: Additional Information
ar: معلومات إضافية

# templateRequiresAdditionalInfo
source: This template requires additional information to be collected from agents.
ar: هذا القالب يتطلب معلومات إضافية ليتم جمعها من الوكلاء.

source: Custom Form Fields
ar: حقول النموذج المخصص

source: Add Field
ar: إضافة حقل

# createCustomFieldsInfo
source: Create custom fields that agents will fill out when completing this task
ar: إنشاء حقول مخصصة سيملأها الوكلاء عند إكمال هذه المهمة
