Repository: abdulasaad/myapp
Catalog: lib/l10n/app_*.arb
Languages: ar

source: No custom fields yet
ar: لا توجد حقول مخصصة حتى الآن

# clickAddFieldToCreate
source: Click "Add Field" to create form fields
ar: اضغط "إضافة حقل" لإنشاء حقول النموذج

source: Edit Field
ar: تعديل الحقل

source: Add Custom Field
ar: إضافة حقل مخصص

# fieldLabelRequired
source: Field Label*
ar: تسمية الحقل*

# fieldLabelHint
source: e.g., Customer Name, Satisfaction Level
ar: مثال: اسم العميل، مستوى الرضا

source: Field Type
ar: نوع الحقل

source: Placeholder Text (Optional)
ar: النص المؤقت (اختياري)

# hintTextShownInField
source: Hint text shown in the field
ar: النص التوضيحي المعروض في الحقل

source: Options (comma separated)*
ar: الخيارات (مفصولة بفواصل)*

# optionsHint
source: Option 1, Option 2, Option 3
ar: الخيار 1، الخيار 2، الخيار 3

# agentMustFillField
source: Agent must fill this field
ar: يجب على الوكيل ملء هذا الحقل

source: Field label is required
ar: تسمية الحقل مطلوبة

# optionsRequiredForFieldType
source: Options are required for this field type
ar: الخيارات مطلوبة لهذا النوع من الحقل

source: Update
ar: تحديث

source: Add
ar: إضافة

source: Creating Task...
ar: إنشاء المهمة...

source: Create Task
ar: إنشاء مهمة

source: Validation Errors
ar: أخطاء التحقق

source: Set Up Geofence
ar: إعداد السياج الجغرافي

# taskRequiresLocationBoundary
source: This task requires a location boundary. Would you like to set up the geofence now?
ar: هذه المهمة تتطلب حدود موقع. هل تريد إعداد السياج الجغرافي الآن؟

source: Skip
ar: تخطي

source: Set Up Now
ar: إعداد الآن

source: Set Geofence - {taskTitle}
ar: تحديد السياج الجغرافي - {taskTitle}

source: Clear all points
ar: مسح جميع النقاط

# tapMapToAddPoints
source: Tap on the map to add points. You need at least 3 points to create a geofence.
ar: اضغط على الخريطة لإضافة نقاط. تحتاج إلى 3 نقاط على الأقل لإنشاء سياج جغرافي.

# pointsAdded
source: {pointCount} points added
ar: تمت إضافة {pointCount} نقطة

source: Ready to Save
ar: جاهز للحفظ

source: Save Geofence
ar: حفظ السياج الجغرافي

# addAtLeastThreePoints
source: Please add at least 3 points to create a geofence
ar: يرجى إضافة 3 نقاط على الأقل لإنشاء سياج جغرافي

source: Campaign Report
ar: تقرير الحملة

source: Campaign Progress
ar: تقدم الحملة

source: Tasks Completed
ar: المهام المكتملة

source: Total Points Earned
ar: إجمالي النقاط المكتسبة

source: No report data available.
ar: لا توجد بيانات تقرير متاحة.

source: Recent Visits
ar: الزيارات الحديثة

source: Total Visits
ar: إجمالي الزيارات

source: Active Now
ar: نشط الآن

source: Total Hours
ar: إجمالي الساعات

source: Quick Stats
ar: إحصائيات سريعة

# averageVisitDuration
source: Average visit duration: {duration} minutes
ar: متوسط مدة الزيارة: {duration} دقيقة

# activeRouteAssignments
source: Active route assignments: {count}
ar: تعيينات المسار النشط: {count}

source: No recent visits found
ar: لم يتم العثور على زيارات حديثة

source: Checked In
ar: تم تسجيل الدخول

source: Unknown Place
ar: مكان غير معروف

source: Unknown
ar: غير معروف

source: No active route assignments
ar: لا توجد تعيينات مسار نشطة

# assignmentDetails
source: Assignment details - Coming soon!
ar: تفاصيل التعيين - قريباً!

source: Management Overview
ar: نظرة عامة على الإدارة

source: Route Management
ar: إدارة المسارات

source: Create & manage routes
ar: إنشاء وإدارة المسارات

source: Place Management
ar: إدارة الأماكن

source: Approve agent suggestions
ar: الموافقة على اقتراحات المندوبين

source: Live Map
ar: الخريطة المباشرة

# trackAgentsRealTime
source: Track agents in real-time
ar: تتبع المندوبين في الوقت الفعلي

source: Manage Tasks
ar: إدارة المهام

source: Review Evidence
ar: مراجعة الأدلة

source: Routes & Places
ar: المسارات والأماكن

source: Calendar
ar: التقويم

source: Location History
ar: تاريخ المواقع

source: Send Notification
ar: إرسال إشعار

source: Message users
ar: مراسلة المستخدمين

source: Loading dashboard...
ar: جاري تحميل لوحة التحكم...

source: Welcome
ar: مرحباً

source: Manager Dashboard
ar: لوحة تحكم المدير

source: System Tasks
ar: مهام النظام

source: Templates
ar: القوالب

source: Manager Performance
ar: أداء المديرين

source: Task Requirements
ar: متطلبات المهمة

source: Online Now
ar: متصل الآن

source: Top Performers
ar: الأفضل أداءً

source: Top Performing Managers
ar: المديرون الأفضل أداءً

source: System Performance
ar: أداء النظام

source: Weekly Tasks
ar: المهام الأسبوعية

source: Completed this week
ar: مكتملة هذا الأسبوع

source: Monthly Tasks
ar: المهام الشهرية

source: Completed this month
ar: مكتملة هذا الشهر

source: Approval Rate
ar: معدل الموافقة

source: Evidence quality
ar: جودة الأدلة

source: System Health
ar: صحة النظام

source: Overall status
ar: الحالة العامة

source: Recent System Activity
ar: النشاط الحديث للنظام

source: No recent activity
ar: لا يوجد نشاط حديث

# loadingEllipsis
source: Loading...
ar: جاري التحميل...

source: Error loading route data
ar: خطأ في تحميل بيانات المسار

source: Another Device Active
ar: جهاز آخر نشط

# accountLoggedInElsewhere
source: Your account is currently logged in on another device.
ar: حسابك مسجل حالياً على جهاز آخر.

# logoutOtherDeviceInstruction
source: To continue logging in on this device, you need to logout from the other device first.
ar: للمتابعة في تسجيل الدخول على هذا الجهاز، تحتاج لتسجيل الخروج من الجهاز الآخر أولاً.

source: Logout Other Device
ar: إخراج الجهاز الآخر

# noGpsSignalOnebar
source: No GPS signal (1 bar)
ar: لا توجد إشارة GPS (شريط واحد)

# excellentGpsFiveBars
source: Excellent GPS ({accuracy}m) - 5 bars
ar: GPS ممتاز ({accuracy}م) - 5 أشرطة

# goodGpsFourBars
source: Good GPS ({accuracy}m) - 4 bars
ar: GPS جيد ({accuracy}م) - 4 أشرطة

# fairGpsThreeBars
source: Fair GPS ({accuracy}m) - 3 bars
ar: GPS متوسط ({accuracy}م) - 3 أشرطة

# poorGpsTwoBars
source: Poor GPS ({accuracy}m) - 2 bars
ar: GPS ضعيف ({accuracy}م) - شريطان

# veryPoorGpsOnebar
source: Very poor GPS ({accuracy}m) - 1 bar
ar: GPS ضعيف جداً ({accuracy}م) - شريط واحد

source: Downloading update...
ar: جاري تحميل التحديث...

source: Download complete. Ready to install.
ar: اكتمل التحميل. جاهز للتثبيت.

source: Installing update...
ar: جاري تثبيت التحديث...

# installationStartedSecurityDialog
source: Installation started. If you see a security scan dialog, tap "Install without scanning" to proceed quickly.
ar: بدأ التثبيت. إذا ظهر لك حوار فحص الأمان، اضغط على "تثبيت بدون فحص" للمتابعة بسرعة.

# failedToDownloadUpdate
source: Failed to download update. Please try again.
ar: فشل في تحميل التحديث. يرجى المحاولة مرة أخرى.

# updateError
source: Error: {error}
ar: خطأ: {error}

source: Update Available
ar: تحديث متوفر

source: Current
ar: الحالي

# newVersion
source: New
ar: الجديد

source: What's New
ar: ما الجديد

# downloadSize
source: Download size: {size} MB
ar: حجم التحميل: {size} ميجابايت

source: Updating...
ar: جاري التحديث...

source: Update Now
ar: تحديث الآن

# titleRequired
source: Title *
ar: العنوان *

# enterTitleForEvidence
source: Enter a title for this evidence
ar: أدخل عنواناً لهذا الدليل

source: Title is required
ar: العنوان مطلوب

# titleMinLength
source: Title must be at least 3 characters
ar: العنوان يجب أن يكون 3 أحرف على الأقل

source: Optional description or notes
ar: وصف أو ملاحظات اختيارية

source: Uploading... {progress}%
ar: جاري الرفع... {progress}%

# fileTooLargeMaxSize
source: File too large. Maximum size is 50MB.
ar: الملف كبير جداً. الحد الأقصى 50 ميجابايت.

# errorSelectingFile
source: Error selecting file: {error}
ar: خطأ في اختيار الملف: {error}

source: File has no data
ar: الملف لا يحتوي على بيانات

source: Place
ar: مكان

source: Evidence {number}
ar: دليل {number}

# evidenceRequiredProgress
source: Evidence Required: {remaining} more needed ({current}/{total})
ar: دليل مطلوب: {remaining} أكثر مطلوب ({current}/{total})

# evidenceComplete
source: Evidence Complete: {current}/{total} submitted
ar: الدليل مكتمل: تم إرسال {current}/{total}

source: Evidence Title (Required)
ar: عنوان الدليل (مطلوب)

# optionalNotesAboutEvidence
source: Optional notes about this evidence
ar: ملاحظات اختيارية حول هذا الدليل

source: Instructions
ar: التعليمات

source: Select Evidence File
ar: اختر ملف الدليل

source: Take Photo/Video
ar: التقط صورة/فيديو

source: OR
ar: أو

source: Upload File
ar: رفع ملف

source: Uploading evidence...
ar: جاري رفع الدليل...

source: Form submitted
ar: تم إرسال النموذج

source: Form data available
ar: بيانات النموذج متوفرة

source: Form Submission
ar: إرسال نموذج

source: Evidence File
ar: ملف دليل

source: No data
ar: لا توجد بيانات

source: Previous Submissions ({count})
ar: الإرسالات السابقة ({count})

source: View All Submissions
ar: عرض جميع الإرسالات

# formSubmissionUppercase
source: FORM SUBMISSION
ar: إرسال نموذج

# evidenceUploadUppercase
source: EVIDENCE UPLOAD
ar: رفع دليل

source: Remove
ar: إزالة

source: from
ar: من

source: Are you sure you want to remove
ar: هل أنت متأكد من رغبتك في إزالة

source: from this route
ar: من هذا المسار

source: Place removed from route successfully
ar: تم إزالة المكان من المسار بنجاح

source: Error removing place from route
ar: خطأ في إزالة المكان من المسار

source: Cannot Delete Route
ar: لا يمكن حذف المسار

# theRouteCannotBeDeletedBecauseItHasHistoricalDataOrActiveAssignments
source: The route "{routeName}" cannot be deleted because it has historical data or active assignments
ar: لا يمكن حذف المسار "{routeName}" لأنه يحتوي على بيانات تاريخية أو تخصيصات نشطة

# assignedToAgents
source: Assigned to {count} agents
ar: مخصص لـ {count} وكلاء

# hasVisitRecordsThisHistoricalDataCannotBeDeletedToMaintainAuditTrail
source: Has {count} visit records. This historical data cannot be deleted to maintain audit trail
ar: يحتوي على {count} سجل زيارة. لا يمكن حذف هذه البيانات التاريخية للحفاظ على مسار التدقيق

source: What you can do:
ar: ما يمكنك فعله:

source: Remove agent assignments first
ar: إزالة تخصيصات الوكلاء أولاً

source: Archive the route instead of deleting to preserve historical data
ar: أرشف المسار بدلاً من حذفه للحفاظ على البيانات التاريخية

source: Archive
ar: أرشف

source: Route deleted successfully
ar: تم حذف المسار بنجاح

source: Error deleting route
ar: خطأ في حذف المسار

source: Are you sure you want to archive
ar: هل أنت متأكد من رغبتك في أرشفة

source: The route will be moved to archived status. All historical data will be preserved and it will no longer be available for new assignments.
ar: سيتم نقل المسار إلى حالة مؤرشف. سيتم الحفاظ على جميع البيانات التاريخية ولن يكون متاحاً للتخصيصات الجديدة.

source: Route archived successfully
ar: تم أرشفة المسار بنجاح

source: Error archiving route
ar: خطأ في أرشفة المسار

source: File URL not available
ar: رابط الملف غير متاح

source: Route Name
ar: اسم المسار

source: Enter route name
ar: أدخل اسم المسار

source: Route name is required
ar: اسم المسار مطلوب

source: Brief description of the route
ar: وصف موجز للمسار

source: Estimated Duration
ar: المدة المقدرة

source: Hours
ar: ساعات

source: Minutes
ar: دقائق

source: Schedule
ar: الجدولة

source: All available places have been added to the route
ar: تم إضافة جميع الأماكن المتاحة إلى المسار

source: Required Evidence
ar: الأدلة المطلوبة

source: Visit Frequency
ar: تكرار الزيارة

source: Edit mode active
ar: وضع التحرير نشط

source: Tap on the map or drag the marker to change the location
ar: اضغط على الخريطة أو اسحب العلامة لتغيير الموقع

source: Geofence
ar: السياج الجغرافي

source: No visits yet
ar: لا توجد زيارات بعد

source: Create
ar: إنشاء

source: Save
ar: حفظ

source: Details
ar: التفاصيل

# pleaseSelectFile
source: Please select a file
ar: يرجى اختيار ملف

source: Task status updated!
ar: تم تحديث حالة المهمة!

source: Failed to update status.
ar: فشل في تحديث الحالة.

source: Error uploading evidence
ar: خطأ في رفع الدليل

# noTasksAssigned
source: You have not been assigned any tasks for this campaign.
ar: لم يتم تكليفك بأي مهام لهذه الحملة.

source: Uploading evidence... {progress}%
ar: جاري رفع الدليل... {progress}%

# zoneCountFormat
source: {current} of {total}
ar: {current} من {total}

# taskHasLocationNameNoGeofence
source: This task has a location name but no geofence area defined. You can submit evidence from any location.
ar: هذه المهمة لديها اسم موقع ولكن لم يتم تحديد منطقة جغرافية. يمكنك تقديم الأدلة من أي موقع.

# noLocationSetDescription
source: The manager has not set a specific location or geofence for this task. You can submit evidence from any location.
ar: لم يحدد المدير موقعاً محدداً أو منطقة جغرافية لهذه المهمة. يمكنك تقديم الأدلة من أي موقع.

# pointsCount
source: {count} points
ar: {count} نقاط

# assignmentPendingDescription
source: Your assignment to this task is pending approval. You cannot access task details until it is approved.
ar: تكليفك بهذه المهمة معلق في انتظار الموافقة. لا يمكنك الوصول إلى تفاصيل المهمة حتى تتم الموافقة عليها.

source: Template not found
ar: لم يتم العثور على القالب

# templateNotFoundDescription
source: This task template could not be loaded.
ar: لا يمكن تحميل قالب هذه المهمة.

source: Location Verification Required
ar: مطلوب التحقق من الموقع

# taskAssignmentPendingApproval
source: This task assignment is pending approval from your manager. You cannot start work until it is approved.
ar: تكليف هذه المهمة معلق في انتظار موافقة مديرك. لا يمكنك بدء العمل حتى تتم الموافقة عليه.

# uploadMoreEvidenceFormat
source: Upload {count} more evidence file(s) to complete this task
ar: ارفع {count} ملف دليل إضافي لإتمام هذه المهمة

# noTasksAssignedDescription
source: There are no tasks assigned to you in this campaign yet. Check back later or contact your manager.
ar: لا توجد مهام مكلف بها في هذه الحملة حتى الآن. تحقق مرة أخرى لاحقاً أو اتصل بمديرك.

source: ACTIVE VISIT
ar: الزيارة النشطة

# pointsFormat
source: {points} points
ar: {points} نقطة

# ptsFormat
source: {points} pts
ar: {points} نقطة

# appTitle
source: Al-Tijwal
ar: الطجوال

# signUpSuccessMessage
source: Sign up successful! Please check your email to confirm.
ar: تم التسجيل بنجاح! يرجى التحقق من بريدك الإلكتروني للتأكيد.

# stopServicesQuestion
source: Stop Services?
ar: إيقاف الخدمات؟

# stopServicesWarning
source: This will stop location tracking and status updates. Your manager will not be able to see your location or online status. Are you sure you want to stop all services?
ar: سيؤدي هذا إلى إيقاف تتبع الموقع وتحديثات الحالة. لن يتمكن مديرك من رؤية موقعك أو حالتك عبر الإنترنت. هل أنت متأكد من أنك تريد إيقاف جميع الخدمات؟

source: Stop Services
ar: إيقاف الخدمات

source: Background services stopped
ar: تم إيقاف الخدمات الخلفية

source: Services Disabled
ar: الخدمات معطلة

# servicesActiveMessage
source: Location tracking and status updates are now active
ar: تتبع الموقع وتحديثات الحالة نشطة الآن

source: Services Started
ar: تم بدء الخدمات

# failedToStartServices
source: Failed to start services. Please check permissions.
ar: فشل في بدء الخدمات. يرجى التحقق من الأذونات.

source: Service Error
ar: خطأ في الخدمة

source: Unable to toggle services
ar: غير قادر على تبديل الخدمات

source: Service Details
ar: تفاصيل الخدمة

source: Location Tracking
ar: تتبع الموقع

source: Online Status
ar: الحالة عبر الإنترنت

source: Broadcasting
ar: البث

source: Heartbeat
ar: نبضة القلب

source: Every 30s
ar: كل 30 ثانية

source: Stopped
ar: متوقف

source: Back online
ar: عاد للاتصال

source: Error loading user profile
ar: خطأ في تحميل ملف المستخدم

source: Delete Field
ar: حذف الحقل

# confirmDeleteField
source: Are you sure you want to delete "{fieldName}"?
ar: هل أنت متأكد من أنك تريد حذف "{fieldName}"؟

source: Add Task
ar: إضافة مهمة

source: Done
ar: تم

source: New Zone
ar: منطقة جديدة

source: Rename Zone
ar: إعادة تسمية المنطقة

source: Zone Name
ar: اسم المنطقة

source: Pick a color
ar: اختر لونًا

# allTeamMembersOnline
source: All team members are currently online. Great job keeping the team active!
ar: جميع أعضاء الفريق متصلون حاليًا. عمل رائع في الحفاظ على نشاط الفريق!

# noTeamMembersAssigned
source: You don't have any team members assigned to your groups yet. Contact your administrator to add agents to your groups.
ar: ليس لديك أي أعضاء فريق مكلفين لمجموعاتك حتى الآن. اتصل بالمدير لإضافة وكلاء إلى مجموعاتك.

source: Update Name
ar: تحديث الاسم

source: Enter new password
ar: أدخل كلمة مرور جديدة

# editNameForAgent
source: Edit name for @{username}
ar: تعديل الاسم لـ @{username}

source: Enter agent full name
ar: أدخل الاسم الكامل للوكيل

source: New Password
ar: كلمة مرور جديدة

# enterNewPasswordFor
source: Enter new password for {fullName}
ar: أدخل كلمة مرور جديدة لـ {fullName}

# createFirstRoute
source: Create your first route to get started
ar: أنشئ أول مسار لك للبدء

source: Create New Task
ar: إنشاء مهمة جديدة

# chooseFromProfessionalTemplates
source: Choose from professional task templates by category
ar: اختر من قوالب المهام المهنية حسب الفئة

# createCustomTaskDescription
source: Create a custom task with specific requirements
ar: أنشئ مهمة مخصصة بمتطلبات محددة

# createFirstTaskToGetStarted
source: Create your first task to get started with task management
ar: أنشئ أول مهمة لك للبدء في إدارة المهام

source: Create Template
ar: إنشاء قالب

# selectCategory
source: Select a category
ar: اختر فئة

source: Create New Template
ar: إنشاء قالب جديد

source: Back
ar: رجوع

source: Next
ar: التالي

source: Error loading categories
ar: خطأ في تحميل الفئات

source: Template created successfully!
ar: تم إنشاء القالب بنجاح!

source: Error creating template
ar: خطأ في إنشاء القالب

source: Basic Information
ar: المعلومات الأساسية

# tellUsAboutTemplate
source: Tell us about your template
ar: أخبرنا عن قالبك

# templateNameRequired
source: Template Name *
ar: اسم القالب *

# templateNameHint
source: e.g., Hospital Equipment Check
ar: مثال: فحص معدات المستشفى

# descriptionRequired
source: Description *
ar: الوصف *

# describeAgentTask
source: Describe what agents need to do...
ar: صف ما يحتاج الوكلاء للقيام به...

# categoryRequired
source: Category *
ar: الفئة *

# configureAgentRequirements
source: Configure what agents need to provide
ar: تكوين ما يحتاج الوكلاء لتقديمه

source: Difficulty Level
ar: مستوى الصعوبة

source: Estimated Duration (minutes)
ar: المدة المقدرة (بالدقائق)

source: Reward Points
ar: نقاط المكافأة

source: Requires Geofence
ar: يتطلب جيوفنس

# taskMustBeCompletedAtLocation
source: Task must be completed at specific location
ar: يجب إكمال المهمة في موقع محدد

source: Custom Instructions (Optional)
ar: تعليمات مخصصة (اختيارية)

source: Additional instructions for agents...
ar: تعليمات إضافية للوكلاء...

# reviewAndCreate
source: Review & Create
ar: مراجعة وإنشاء

# verifyTemplateBeforeCreating
source: Verify your template before creating
ar: تحقق من قالبك قبل الإنشاء

source: Template Name
ar: اسم القالب

source: Not selected
ar: غير محدد

source: Difficulty
ar: الصعوبة

# minutesFormat
source: {minutes} minutes
ar: {minutes} دقيقة

source: Reward
ar: المكافأة

source: Geofence Required
ar: الجيوفنس مطلوب

source: Yes
ar: نعم

source: No
ar: لا

source: Photo
ar: صورة

source: Audio
ar: صوت

source: Step {x} of {y}
ar: الخطوة {x} من {y}

source: Basic Info
ar: المعلومات الأساسية

source: Requirements
ar: المتطلبات

source: Task Management
ar: إدارة المهام

source: Error loading tasks
ar: خطأ في تحميل المهام

source: No Tasks Yet
ar: لا توجد مهام بعد

# confirmDeleteTaskMessage
source: Are you sure you want to delete this task? This action cannot be undone.
ar: هل أنت متأكد من أنك تريد حذف هذه المهمة؟ لا يمكن التراجع عن هذا الإجراء.

source: New Task
ar: مهمة جديدة

source: Task deleted successfully
ar: تم حذف المهمة بنجاح

source: Failed to delete task
ar: فشل في حذف المهمة

source: From Template
ar: من قالب

source: Manage Places
ar: إدارة الأماكن

source: No draft routes
ar: لا توجد مسارات مسودة

source: No routes found
ar: لم يتم العثور على مسارات

source: Route Order:
ar: ترتيب المسار:

# createdByFormat
source: Created by: {name}
ar: أنشأ بواسطة: {name}

# morePlacesFormat
source: ... (+{count} more)
ar: ... (+{count} أكثر)

source: Category
ar: الفئة

# minutesShort
source: min
ar: د

# pointsShort
source: pts
ar: نقاط

source: New Task Assigned
ar: تم تعيين مهمة جديدة

source: Campaign Assignment
ar: تعيين الحملة

source: Title
ar: العنوان

# pointsPrefix
source: Pts
ar: نقاط

source: Confirm Payment
ar: تأكيد الدفع

source: Remove Agent
ar: إزالة الوكيل

source: Task Progress
ar: تقدم المهمة

source: Uploaded Files
ar: الملفات المرفوعة

source: Outstanding
ar: المتبقي

source: Untitled Evidence
ar: دليل بدون عنوان

source: View
ar: عرض

source: Download
ar: تحميل

source: Unknown file
ar: ملف غير معروف

source: Unknown Task
ar: مهمة غير معروفة
