Repository: abdulasaad/myapp
Catalog: lib/l10n/app_*.arb
Languages: ar

# appName
source: Al-Tijwal
ar: التجوال

# loginTitle
source: Welcome Back
ar: أهلاً بعودتك

# loginSubtitle
source: Sign in to your Al-Tijwal account
ar: سجل دخولك إلى حساب التجوال

source: Sign Up
ar: إنشاء حساب

source: Full Name
ar: الاسم الكامل

source: Email
ar: البريد الإلكتروني

source: Username or Email
ar: اسم المستخدم أو البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Login
ar: تسجيل الدخول

source: Required Field
ar: حقل مطلوب

# passwordMinLength
source: Password must be at least 6 characters
ar: يجب أن تكون كلمة المرور 6 أحرف على الأقل

# noInternetConnection
source: No internet connection. Please check your network settings and try again.
ar: لا يوجد اتصال بالإنترنت. يرجى التحقق من إعدادات الشبكة والمحاولة مرة أخرى.

# noInternetMessage
source: No internet connection. Please check your network and try again.
ar: لا يوجد اتصال بالإنترنت. يرجى التحقق من شبكتك والمحاولة مرة أخرى.

# invalidCredentials
source: Invalid credentials. Please check username/email and password.
ar: بيانات اعتماد غير صحيحة. يرجى التحقق من اسم المستخدم/البريد الإلكتروني وكلمة المرور.

source: Login successful!
ar: تم تسجيل الدخول بنجاح!

# unexpectedError
source: An unexpected error occurred.
ar: حدث خطأ غير متوقع.

# signUpSuccessful
source: Sign up successful! Please check your email to confirm.
ar: تم إنشاء الحساب بنجاح! يرجى التحقق من بريدك الإلكتروني للتأكيد.

source: Could not open Facebook
ar: لا يمكن فتح فيسبوك

source: Could not open Instagram
ar: لا يمكن فتح إنستغرام

source: Could not open WhatsApp
ar: لا يمكن فتح واتساب

source: Could not open website
ar: لا يمكن فتح الموقع الإلكتروني

source: Loading...
ar: جاري التحميل...

source: Retry
ar: إعادة المحاولة

# errorLoadingProfile
source: Error loading user profile
ar: خطأ في تحميل ملف المستخدم

source: Dashboard
ar: لوحة التحكم

source: campaigns
ar: حملات

source: Tasks
ar: المهام

source: Profile
ar: الملف الشخصي

source: Home
ar: الرئيسية

source: My Tasks
ar: مهامي

source: You're Offline
ar: أنت غير متصل

# offlineMessage
source: Please check your internet connection to load the dashboard.
ar: يرجى التحقق من اتصال الإنترنت لتحميل لوحة التحكم.

source: Error loading dashboard
ar: خطأ في تحميل لوحة التحكم

source: Please try again later
ar: يرجى المحاولة مرة أخرى لاحقاً

source: Create New
ar: إنشاء جديد

source: Choose Task Type
ar: اختر نوع المهمة

source: Campaign
ar: حملة

# createCampaignDesc
source: Create a new campaign with tasks
ar: إنشاء حملة جديدة مع المهام

source: Task
ar: مهمة

# createTaskDesc
source: Create a standalone task
ar: إنشاء مهمة مستقلة

source: Route
ar: مسار

# createRouteDesc
source: Create a new route
ar: إنشاء مسار جديد

source: Template Task
ar: مهمة قالب

# createTemplateDesc
source: Create from existing template
ar: إنشاء من قالب موجود

source: Custom Task
ar: مهمة مخصصة

# createCustomDesc
source: Create evidence-based task
ar: إنشاء مهمة قائمة على الأدلة

source: Permission required
ar: إذن مطلوب

source: Active
ar: نشط

source: Disabled
ar: معطل

source: Error
ar: خطأ

source: Permission denied
ar: تم رفض الإذن

source: Error occurred
ar: حدث خطأ

source: On Route
ar: في المسار

source: Working Tasks
ar: المهام الجارية

source: In Campaign
ar: في حملة

source: Available
ar: متاح

source: Agent Dashboard
ar: لوحة تحكم المندوب

source: Location Service
ar: خدمة الموقع

source: Routes
ar: المسارات

source: None assigned
ar: لا يوجد مُخصص

source: None active
ar: لا يوجد نشط

source: No active campaigns
ar: لا توجد حملات نشطة

source: places
ar: الأماكن

source: Evidence
ar: الدليل

source: Completion Rate
ar: معدل الإنجاز

source: Peak Hour
ar: ساعة الذروة

source: Avg Duration
ar: متوسط المدة

source: Week Total
ar: إجمالي الأسبوع

source: Month Total
ar: إجمالي الشهر

source: Unique Locations
ar: المواقع الفريدة

source: Visit Analytics
ar: تحليلات الزيارات

source: Visits today
ar: زيارات اليوم

source: Active Tasks
ar: المهام النشطة

source: Tasks in progress
ar: المهام قيد التنفيذ

source: Total Points
ar: إجمالي النقاط

source: Points Earned:
ar: النقاط المكتسبة:

source: Active Campaigns
ar: الحملات النشطة

source: Campaigns running
ar: الحملات الجارية

source: Active Routes
ar: المسارات النشطة

source: Routes assigned
ar: المسارات المخصصة

source: Quick Actions
ar: الإجراءات السريعة

source: Suggest
ar: اقتراح

source: Map
ar: الخريطة

source: Cancel
ar: إلغاء

source: Enable
ar: تفعيل

source: Sign Out
ar: تسجيل الخروج

source: Settings
ar: الإعدادات

source: Notifications
ar: الإشعارات

source: Help & Support
ar: المساعدة والدعم

source: About
ar: حول

source: Language
ar: اللغة

source: Welcome back
ar: أهلاً بعودتك

source: Today's Activity
ar: نشاط اليوم

source: to visit today
ar: للزيارة اليوم

source: completed today
ar: مكتمل اليوم

source: active campaign
ar: حملة نشطة

source: Current Campaign
ar: الحملة الحالية

source: Start Guided Task
ar: بدء المهمة الموجهة

source: Quick Upload
ar: رفع سريع

source: Mark Done
ar: تحديد كمنجز

source: IN PROGRESS
ar: قيد التنفيذ

source: Select Language
ar: اختر اللغة

# languageChanged
source: Language changed successfully
ar: تم تغيير اللغة بنجاح

# restartRequired
source: Please restart the app to apply language changes
ar: يرجى إعادة تشغيل التطبيق لتطبيق تغييرات اللغة

# languageDesc
source: Choose your preferred language
ar: اختر لغتك المفضلة

source: Confirm Delete
ar: تأكيد الحذف

# confirmDeleteCampaign
source: Are you sure you want to delete "{name}"? This action cannot be undone.
ar: هل أنت متأكد من رغبتك في حذف "{name}"؟ هذا الإجراء لا يمكن التراجع عنه.

# campaignDeleted
source: Campaign "{name}" deleted successfully.
ar: تم حذف الحملة "{name}" بنجاح.

# errorDeletingCampaign
source: Error deleting campaign: {error}
ar: خطأ في حذف الحملة: {error}

source: No Campaigns Yet
ar: لا توجد حملات بعد

# createFirstCampaign
source: Create your first campaign to get started with managing tasks and agents
ar: أنشئ حملتك الأولى للبدء في إدارة المهام والمندوبين

source: No Campaigns Assigned
ar: لا توجد حملات مُخصصة

# viewAssignedCampaigns
source: You will see assigned campaigns here when available
ar: ستشاهد الحملات المُخصصة هنا عند توفرها

source: Edit Campaign
ar: تعديل الحملة

source: Delete Campaign
ar: حذف الحملة

source: Inside geofence
ar: داخل النطاق الجغرافي

source: Outside geofence
ar: خارج النطاق الجغرافي

source: View Task Location
ar: عرض موقع المهمة

source: Ends:
ar: تنتهي:

source: My Campaigns
ar: حملاتي

# unableToLoadCampaigns
source: Unable to load campaigns. Please check your connection and try again.
ar: غير قادر على تحميل الحملات. يرجى التحقق من اتصالك والمحاولة مرة أخرى.

source: Error loading campaigns
ar: خطأ في تحميل الحملات

source: Add New Task
ar: إضافة مهمة جديدة

source: Task Title
ar: عنوان المهمة

source: Assign an Agent
ar: تعيين مندوب

source: Assigned Agents
ar: المندوبين المعينين

source: Assign Agent
ar: تعيين مندوب

# noTasksCreated
source: No tasks created yet.
ar: لم يتم إنشاء مهام بعد.

# noAgentsAssigned
source: No agents assigned yet.
ar: لم يتم تعيين مندوبين بعد.

source: Edit Task
ar: تعديل المهمة

source: Delete Task
ar: حذف المهمة

source: Manage Geofences
ar: إدارة النطاقات الجغرافية

source: Confirm Removal
ar: تأكيد الإزالة

# removeAgentConfirmation
source: Are you sure you want to remove {name} from this campaign?
ar: هل أنت متأكد من رغبتك في إزالة {name} من هذه الحملة؟

# payAgent
source: Pay {name}
ar: دفع لـ {name}

source: Amount Paid
ar: المبلغ المدفوع

source: Outstanding Balance
ar: الرصيد المستحق

source: Loading earnings...
ar: جاري تحميل الأرباح...

# taskAddedSuccess
source: Task added and assigned to all campaign agents!
ar: تم إضافة المهمة وتعيينها لجميع مندوبي الحملة!

# taskAddFailed
source: Failed to add task: {error}
ar: فشل في إضافة المهمة: {error}

# agentAssignedSuccess
source: Agent assigned to campaign. All tasks have been assigned.
ar: تم تعيين المندوب للحملة. تم تعيين جميع المهام.

# agentAssignFailed
source: Failed to assign agent: {error}
ar: فشل في تعيين المندوب: {error}

# taskUpdatedSuccess
source: Task updated successfully!
ar: تم تحديث المهمة بنجاح!

# taskUpdateFailed
source: Failed to update task: {error}
ar: فشل في تحديث المهمة: {error}

# taskDeletedSuccess
source: Task deleted successfully!
ar: تم حذف المهمة بنجاح!

# taskDeleteFailed
source: Failed to delete task: {error}
ar: فشل في حذف المهمة: {error}

# agentRemovedSuccess
source: Agent removed successfully.
ar: تم إزالة المندوب بنجاح.

# agentRemoveFailed
source: Failed to remove agent: {error}
ar: فشل في إزالة المندوب: {error}

# paymentRecordedSuccess
source: Payment recorded successfully!
ar: تم تسجيل الدفع بنجاح!

# paymentRecordFailed
source: Failed to record payment: {error}
ar: فشل في تسجيل الدفع: {error}

source: PAY
ar: دفع

# mustBeNumber
source: Must be a number
ar: يجب أن يكون رقماً

source: Upload Evidence
ar: رفع دليل

source: Evidence Name
ar: اسم الدليل

source: Enter evidence name
ar: أدخل اسم الدليل

# evidenceNameRequired
source: Evidence name is required
ar: اسم الدليل مطلوب

source: Select File
ar: اختر ملف

source: Change File
ar: تغيير الملف

source: Upload
ar: رفع

source: Take Photo
ar: التقاط صورة

source: Capture with camera
ar: التقاط بالكاميرا

source: Choose Image
ar: اختيار صورة

source: Select from gallery
ar: اختيار من المعرض

source: Record Video
ar: تسجيل فيديو

source: Capture video
ar: تسجيل فيديو

source: Choose Video
ar: اختيار فيديو

# selectVideoFromGallery
source: Select from gallery
ar: اختيار من المعرض

source: Choose Document
ar: اختيار مستند

# documentTypes
source: PDF, Word, Excel, etc.
ar: PDF، Word، Excel، إلخ.

source: Any File
ar: أي ملف

source: Browse all files
ar: تصفح جميع الملفات

source: Image
ar: صورة

source: Video
ar: فيديو

source: Document
ar: مستند

source: File
ar: ملف

source: Approved
ar: موافق عليه

source: Rejected
ar: مرفوض

source: Pending Review
ar: في انتظار المراجعة

source: Confirm Deletion
ar: تأكيد الحذف

# confirmDeleteEvidence
source: Are you sure you want to delete "{title}"?
ar: هل أنت متأكد من رغبتك في حذف "{title}"؟

source: Delete
ar: حذف

# evidenceDeletedSuccess
source: Evidence deleted successfully.
ar: تم حذف الدليل بنجاح.

# evidenceDeleteFailed
source: Failed to delete evidence: {error}
ar: فشل في حذف الدليل: {error}

# taskStatusReverted
source: Task status reverted to pending.
ar: تم إرجاع حالة المهمة إلى قيد الانتظار.

source: Confirm Completion
ar: تأكيد الإنجاز

# confirmMarkTaskDone
source: Are you sure you want to mark this task as done? This cannot be undone.
ar: هل أنت متأكد من رغبتك في تمييز هذه المهمة كمنجزة؟ لا يمكن التراجع عن هذا الإجراء.

source: Confirm
ar: تأكيد

# taskCompletedSuccess
source: Task marked as completed!
ar: تم تمييز المهمة كمنجزة!

# uploadFailed
source: Upload failed: {error}
ar: فشل الرفع: {error}

source: Checking Location...
ar: جارٍ فحص الموقع...

# geofenceValidationFailed
source: You must be within the task location area to upload evidence. Please move to the designated location and try again.
ar: يجب أن تكون داخل منطقة المهمة المحددة لرفع الأدلة. يرجى الانتقال إلى الموقع المحدد والمحاولة مرة أخرى.

source: Location Verified!
ar: تم التحقق من الموقع!

# fileTooLarge
source: File too large. Maximum size is 50MB.
ar: الملف كبير جداً. الحد الأقصى للحجم هو 50 ميجابايت.

# evidenceUploadedSuccess
source: Evidence uploaded successfully.
ar: تم رفع الدليل بنجاح.

source: File URL
ar: رابط الملف

source: Close
ar: إغلاق

source: Open
ar: فتح

# couldNotOpenFile
source: Could not open file: {error}
ar: لا يمكن فتح الملف: {error}

# fileViewerInfo
source: This file can be viewed in your device's document viewer.
ar: يمكن عرض هذا الملف في عارض المستندات في جهازك.

# videoPlayerInfo
source: This video can be played in your device's video player.
ar: يمكن تشغيل هذا الفيديو في مشغل الفيديو في جهازك.

# compatibleAppInfo
source: This file can be opened with a compatible app on your device.
ar: يمكن فتح هذا الملف بتطبيق متوافق في جهازك.

source: Rejection Reason
ar: سبب الرفض

source: Approve Evidence
ar: الموافقة على الدليل

# confirmApproveEvidence
source: Are you sure you want to approve "{title}"?
ar: هل أنت متأكد من رغبتك في الموافقة على "{title}"؟

source: Approve
ar: موافقة

# evidenceApprovedSuccess
source: Evidence approved successfully
ar: تم الموافقة على الدليل بنجاح

# evidenceApproveFailed
source: Failed to approve evidence: {error}
ar: فشل في الموافقة على الدليل: {error}

source: Reject Evidence
ar: رفض الدليل

# confirmRejectEvidence
source: Are you sure you want to reject "{title}"?
ar: هل أنت متأكد من رغبتك في رفض "{title}"؟

# rejectionReasonLabel
source: Rejection Reason
ar: سبب الرفض

# rejectionReasonHint
source: Explain why this evidence is being rejected
ar: اشرح سبب رفض هذا الدليل

# rejectionReasonRequired
source: Please provide a reason for rejection
ar: يرجى تقديم سبب للرفض

source: Reject
ar: رفض

# evidenceRejectedSuccess
source: Evidence rejected
ar: تم رفض الدليل

# evidenceRejectFailed
source: Failed to reject evidence: {error}
ar: فشل في رفض الدليل: {error}

# noEvidenceSubmitted
source: No evidence submitted yet.
ar: لم يتم تقديم أدلة بعد.

# progressLabel
source: Progress: {current} of {total} uploaded
ar: التقدم: {current} / {total}

source: Status: Completed
ar: الحالة: منجزة

# isManager
source: Is Manager: {isManager}
ar: هو مدير: {isManager}

source: View Evidence
ar: عرض الدليل

source: Delete Evidence
ar: حذف الدليل

source: Mark as Done
ar: تمييز كمنجزة

source: Assignment Pending
ar: التكليف معلق

# assignmentPendingMessage
source: Your assignment to this task is currently pending approval from a manager. You cannot access task details or submit evidence until it is approved. Please check back later or contact your manager.
ar: تكليفك لهذه المهمة في انتظار الموافقة من مدير. لا يمكنك الوصول إلى تفاصيل المهمة أو تقديم أدلة حتى تتم الموافقة عليه. يرجى المراجعة لاحقاً أو الاتصال بمديرك.

source: Go Back
ar: العودة

# errorLoadingTaskAssignment
source: Error loading task assignment: {error}
ar: خطأ في تحميل تكليف المهمة: {error}

source: No description.
ar: لا يوجد وصف.

source: No location name
ar: لا يوجد اسم موقع

source: Overview
ar: نظرة عامة

source: Location Verification
ar: التحقق من الموقع

source: Evidence Upload
ar: رفع الأدلة

source: Complete
ar: إكمال

source: Task Overview
ar: نظرة عامة على المهمة

source: Points
ar: النقاط

source: Location Check Required
ar: فحص الموقع مطلوب

# mustBeWithinArea
source: You must be within the specified area
ar: يجب أن تكون داخل المنطقة المحددة

source: Evidence Required
ar: الأدلة المطلوبة

# uploadPhotosOrFiles
source: Upload photos or files as proof of completion
ar: رفع الصور أو الملفات كدليل على الإنجاز

source: Start Task
ar: بدء المهمة

# withinRequiredArea
source: You are within the required task area. You can now proceed to upload evidence.
ar: أنت ضمن منطقة المهمة المطلوبة. يمكنك الآن المتابعة لرفع الأدلة.

source: Move to Designated Area
ar: انتقل إلى المنطقة المحددة

source: View Map
ar: عرض الخريطة

source: Check Location
ar: فحص الموقع

source: Continue to Evidence
ar: المتابعة إلى الأدلة

source: Verify Location First
ar: تحقق من الموقع أولاً

source: Evidence Uploaded!
ar: تم رفع الأدلة!

# successfullyUploadedEvidence
source: You have successfully uploaded evidence for this task. You can add more evidence or proceed to complete the task.
ar: لقد قمت برفع الأدلة بنجاح لهذه المهمة. يمكنك إضافة المزيد من الأدلة أو المتابعة لإكمال المهمة.

# uploadEvidenceDesc
source: Upload photos, documents, or other files as evidence that you have completed this task.
ar: رفع الصور أو المستندات أو الملفات الأخرى كدليل على إكمال هذه المهمة.

source: Add More Evidence
ar: إضافة المزيد من الأدلة

source: Upload Evidence First
ar: رفع الأدلة أولاً

source: Task Completed!
ar: اكتملت المهمة

# congratulationsCompleted
source: Congratulations! You have successfully completed "{title}". Your evidence has been submitted for review.
ar: تهانينا! لقد أنجزت بنجاح "{title}". تم إرسال أدلتك للمراجعة.

source: Return to Tasks
ar: العودة إلى المهام

# assignmentPendingTitle
source: Assignment Pending
ar: التكليف في انتظار الموافقة

# assignmentPendingDesc
source: Your assignment to this task is currently pending approval from a manager. You cannot start work until it is approved. Please check back later or contact your manager.
ar: تكليفك لهذه المهمة في انتظار الموافقة من مدير. لا يمكنك بدء العمل حتى تتم الموافقة عليه. يرجى المراجعة لاحقاً أو الاتصال بمديرك.

# notWithinTaskLocation
source: You are not within the task location area. Please move closer to continue.
ar: أنت لست ضمن منطقة موقع المهمة. يرجى الاقتراب أكثر للمتابعة.

# errorCheckingLocation
source: Error checking location: {error}
ar: خطأ في فحص الموقع: {error}

source: Completed
ar: مكتمل

source: Requested
ar: مطلوب

source: OK
ar: موافق

source: Mark All Read
ar: تمييز الكل كمقروء

source: All
ar: الكل

source: Unread
ar: غير مقروء

source: Read
ar: مقروء

source: Just now
ar: الآن

# minutesAgo
source: {minutes}m ago
ar: منذ {minutes} دقيقة

# hoursAgo
source: {hours}h ago
ar: منذ {hours} ساعة

# daysAgo
source: {days}d ago
ar: منذ {days} يوم

# campaignType
source: Campaign
ar: حملة

# taskType
source: Task
ar: مهمة

# routeType
source: Route
ar: مسار

# placeType
source: Place
ar: مكان

# completionType
source: Completion
ar: إنجاز

# evidenceType
source: Evidence
ar: دليل

# generalType
source: General
ar: عام

source: Error loading notifications
ar: خطأ في تحميل الإشعارات

source: No notifications yet
ar: لا توجد إشعارات بعد

source: No {filter} notifications
ar: لا توجد إشعارات {filter}

# notificationsUpdatesMessage
source: You'll see notifications here when there are updates
ar: ستشاهد الإشعارات هنا عند وجود تحديثات

# markedNotificationsRead
source: Marked {count} notifications as read
ar: تم تمييز {count} إشعارات كمقروءة

source: Suggest Place
ar: اقتراح مكان

source: My Routes
ar: مساراتي

source: Currently Visiting
ar: يزور حاليًا

source: Check Out
ar: تسجيل خروج

source: Add Evidence
ar: إضافة دليل

source: Status
ar: الحالة

source: Assigned
ar: المعين

source: No Active Routes
ar: لا توجد مسارات نشطة

source: Created
ar: تم الإنشاء

source: Statistics
ar: الإحصائيات

source: No agents assigned yet
ar: لم يتم تعيين وكلاء بعد

source: Tap 'Assign to Agents' to get started
ar: اضغط على 'تعيين للوكلاء' للبدء

source: Progress Details
ar: تفاصيل التقدم

source: No places in this route
ar: لا توجد أماكن في هذا المسار

source: Are you sure you want to activate
ar: هل أنت متأكد من أنك تريد تفعيل

source: Route activated successfully
ar: تم تفعيل المسار بنجاح

source: Error activating route
ar: خطأ في تفعيل المسار

source: Error loading route details
ar: خطأ في تحميل تفاصيل المسار

source: Route Details
ar: تفاصيل المسار

source: Select Start Date
ar: اختر تاريخ البداية

source: Select End Date
ar: اختر تاريخ النهاية

source: No places added
ar: لم تتم إضافة أماكن

source: Add places to create your route
ar: أضف أماكن لإنشاء مسارك

source: Duration
ar: المدة

source: visits
ar: زيارات

source: Loading places...
ar: جاري تحميل الأماكن...

source: No approved places available. Ask agents to suggest places.
ar: لا توجد أماكن معتمدة متاحة. اطلب من الوكلاء اقتراح أماكن.

source: times to visit
ar: مرات الزيارة

# agentMustVisitTimesWithCooldown
source: Agent must visit {times} times with a {cooldown}-hour cooldown
ar: يجب على الوكيل الزيارة {times} مرات مع فترة انتظار {cooldown} ساعة

source: Visit frequency must be between 1 and 10
ar: يجب أن يكون تكرار الزيارة بين 1 و 10

source: Please add at least one place to the route
ar: يرجى إضافة مكان واحد على الأقل إلى المسار

source: Route created successfully
ar: تم إنشاء المسار بنجاح

source: Error creating route
ar: خطأ في إنشاء المسار

source: Inactive
ar: غير نشط

source: No pending suggestions
ar: لا توجد اقتراحات معلقة

# visitNotStartedYet
source: Visit has not started yet
ar: لم تبدأ الزيارة بعد

# currentlyAtLocation
source: Currently at the location
ar: موجود حالياً في الموقع

source: Visit completed successfully
ar: تمت الزيارة بنجاح

source: Visit was skipped
ar: تم تخطي الزيارة

source: Unknown status
ar: حالة غير معروفة

source: Check In
ar: تسجيل دخول

source: Coordinates
ar: الإحداثيات

source: Error getting location
ar: خطأ في الحصول على الموقع

source: Selected Coordinates:
ar: الإحداثيات المحددة:

# mapInstructions
source: Tap on the map to select a location. Drag the marker to fine-tune. Adjust the geofence radius as needed.
ar: اضغط على الخريطة لتحديد موقع. اسحب العلامة للضبط الدقيق. اضبط نصف قطر السياج الجغرافي حسب الحاجة.

source: Start
ar: البداية

source: End
ar: النهاية

source: Location
ar: الموقع

# sevenDays
source: 7 Days
ar: 7 أيام

# thirtyDays
source: 30 Days
ar: 30 يوم

# ninetyDays
source: 90 Days
ar: 90 يوم

source: Total Entries
ar: إجمالي الإدخالات

source: Avg Accuracy
ar: متوسط الدقة

source: Avg Speed
ar: متوسط السرعة

source: Period
ar: الفترة

# daysSelected
source: {count} days selected
ar: أيام محددة

source: Select Days
ar: اختر الأيام

source: Select Start Time
ar: اختر وقت البداية

source: Select End Time
ar: اختر وقت النهاية

source: History
ar: التاريخ

source: Select Agent
ar: اختر الوكيل

# pleaseSelectAgentForLocationHistory
source: Please select an agent to view location history
ar: يرجى اختيار وكيل لعرض تاريخ المواقع

# noLocationHistoryFound
source: No location history found for the selected period
ar: لم يتم العثور على تاريخ مواقع للفترة المحددة

source: Agent Movement Track
ar: مسار حركة الوكيل

source: Total Locations
ar: إجمالي المواقع

source: Time Period
ar: الفترة الزمنية

source: Start Time
ar: وقت البداية

source: End Time
ar: وقت النهاية

# tapToViewCompleteRoute
source: Tap to view complete route on map
ar: اضغط لعرض المسار الكامل على الخريطة

source: Location Statistics
ar: إحصائيات المواقع

# noLocationDataToDisplay
source: No location data to display on map
ar: لا توجد بيانات مواقع للعرض على الخريطة

source: Place Visit Details
ar: تفاصيل زيارة المكان

source: Place Information
ar: معلومات المكان

source: Visit Status
ar: حالة الزيارة

source: Visit Timing
ar: توقيت الزيارة

source: Not yet
ar: ليس بعد

source: Route Information
ar: معلومات المسار

source: Unknown Route
ar: مسار غير معروف

source: Visit Notes
ar: ملاحظات الزيارة

source: Tap to move location
ar: اضغط لنقل الموقع

# locationPermissionRequired
source: Location permission is required
ar: مطلوب إذن الموقع

# pleaseSelectLocationOnMap
source: Please select a location on the map
ar: يرجى اختيار موقع على الخريطة

source: Select Location
ar: اختر الموقع

source: Agent suggestions will appear here
ar: ستظهر اقتراحات الوكلاء هنا

source: No inactive places
ar: لا توجد أماكن غير نشطة

source: Deactivated places will appear here
ar: ستظهر الأماكن المعطلة هنا

source: Places will appear here once added
ar: ستظهر الأماكن هنا بمجرد إضافتها

source: Suggested by
ar: مقترح من قبل

source: This place is inactive and hidden from new routes
ar: هذا المكان غير نشط ومخفي من المسارات الجديدة

source: Reactivate
ar: إعادة تفعيل

source: Suggestion
ar: اقتراح

source: Are you sure you want to reject
ar: هل أنت متأكد من أنك تريد رفض

source: Explain why this place was rejected
ar: اشرح لماذا تم رفض هذا المكان

source: New Place
ar: مكان جديد

source: Place name is required
ar: اسم المكان مطلوب

source: Brief description of the place
ar: وصف موجز للمكان

source: Physical address
ar: العنوان الفعلي

source: Location selected
ar: تم اختيار الموقع

source: Manager-created places are automatically approved and ready for use
ar: الأماكن التي ينشئها المدير تتم الموافقة عليها تلقائياً وتكون جاهزة للاستخدام

source: Cannot remove place
ar: لا يمكن إزالة المكان

source: The place cannot be deleted because it has historical data or is currently in use
ar: لا يمكن حذف المكان لأنه يحتوي على بيانات تاريخية أو قيد الاستخدام حالياً

source: Used in routes
ar: مستخدم في المسارات

source: Has historical visit records
ar: يحتوي على سجلات زيارات تاريخية

source: Remove this place from all routes first
ar: قم بإزالة هذا المكان من جميع المسارات أولاً
